In [34]:
import pandas as pd
url = "https://www.espn.com/nfl/stats/_/view/team"
tables = pd.read_html(url)

In [2]:
tables[0].head()

  Total Yards  YDS/G
0           1  430.3
1           2  411.7
2           3  407.3
3           4  399.7
4           5  391.7

In [3]:
tables[1].head()

  Passing  YDS/G
0       1  267.7
1       2  255.5
2       3  246.7
3       4  244.7
4       5  244.3

In [4]:
tables[2].head()

  Rushing  YDS/G
0       1  204.0
1       2  203.3
2       3  167.3
3       4  163.0
4       5  153.7

In [5]:
tables[3].head()

  Yards Allowed  YDS/G
0             1  229.0
1             2  248.7
2             3  259.3
3             4  260.7
4             5  263.7

In [6]:
tables[4].head()

  Sacks  SACK
0     1  16.0
1     2  15.0
2     3  14.0
3     4  13.0
4     5  11.0

In [7]:
tables[5].head()

  Turnovers DIFF
0         1    7
1         2    5
2         3    4
3         3    4
4         5    3

In [12]:
Total_Yards = tables[0]
Total_Passing = tables[1]
Total_Rushing = tables[2]
Total_Yards_Allowed = tables[3]
Total_Sacks = tables[4]
Total_Turnovers = tables[5]

In [13]:
type(Total_Yards)

pandas.core.frame.DataFrame

In [14]:
Total_Yards.dtypes

Total Yards    object
YDS/G          object
dtype: object

In [15]:
Total_Passing.dtypes

Passing    object
YDS/G      object
dtype: object

In [16]:
Total_Rushing.dtypes

Rushing    object
YDS/G      object
dtype: object

In [17]:
Total_Yards_Allowed.dtypes

Yards Allowed    object
YDS/G            object
dtype: object

In [18]:
Total_Sacks.dtypes

Sacks    object
SACK     object
dtype: object

In [19]:
Total_Turnovers.dtypes

Turnovers    object
DIFF         object
dtype: object

In [20]:
df_total_yards = pd.DataFrame(Total_Yards)

In [53]:
Teams = ["Baltimore Ravens", "Philadelphia Eagles", "San Francisco 49ers", "Detroit Lions", "Green Bay Packers"]

In [38]:
df1 = pd.DataFrame(Total_Yards)

In [59]:
df1.insert(1, "Team", ["Baltimore Ravens", "Philadelphia Eagles", "San Francisco 49ers", "Detroit Lions", "Green Bay Packers","Team"], True)

In [60]:
print(df1)

        Total Yards                 Team                 Team  \
0                 1     Baltimore Ravens     Baltimore Ravens
1                 2  Philadelphia Eagles  Philadelphia Eagles
2                 3  San Francisco 49ers  San Francisco 49ers
3                 4        Detroit Lions        Detroit Lions
4                 5    Green Bay Packers    Green Bay Packers
5  Complete Leaders                 Team                 Team

                  Team             YDS/G
0                 Team             430.3
1     Baltimore Ravens             411.7
2  Philadelphia Eagles             407.3
3  San Francisco 49ers             399.7
4        Detroit Lions             391.7
5    Green Bay Packers  Complete Leaders

In [55]:
df1.rename(columns={"Total Yards": "Ranking"})

,Ranking,Team,Team,YDS/G
0,1,Baltimore Ravens,Team,430.3
1,2,Philadelphia Eagles,Baltimore Ravens,411.7
2,3,San Francisco 49ers,Philadelphia Eagles,407.3
3,4,Detroit Lions,San Francisco 49ers,399.7
4,5,Green Bay Packers,Detroit Lions,391.7
5,Complete Leaders,Team,Green Bay Packers,Complete Leaders

In [61]:
df1.drop([0,5])

,Total Yards,Team,Team,Team,YDS/G
1,2,Philadelphia Eagles,Philadelphia Eagles,Baltimore Ravens,411.7
2,3,San Francisco 49ers,San Francisco 49ers,Philadelphia Eagles,407.3
3,4,Detroit Lions,Detroit Lions,San Francisco 49ers,399.7
4,5,Green Bay Packers,Green Bay Packers,Detroit Lions,391.7

In [62]:
df1_1 = df1.drop(df1.columns[[2]], axis=1)

In [63]:
print(df1_1)

        Total Yards             YDS/G
0                 1             430.3
1                 2             411.7
2                 3             407.3
3                 4             399.7
4                 5             391.7
5  Complete Leaders  Complete Leaders

In [65]:
df1_1.rename(columns={"Total Yards": "Ranking"})

            Ranking             YDS/G
0                 1             430.3
1                 2             411.7
2                 3             407.3
3                 4             399.7
4                 5             391.7
5  Complete Leaders  Complete Leaders

In [66]:
df1_1.drop([0,5])

  Total Yards  YDS/G
1           2  411.7
2           3  407.3
3           4  399.7
4           5  391.7

In [67]:
df1_1.insert(1, "Team", ["Baltimore Ravens", "Philadelphia Eagles", "San Francisco 49ers", "Detroit Lions", "Green Bay Packers","Team"], True)

In [68]:
print(df1_1)

        Total Yards                 Team             YDS/G
0                 1     Baltimore Ravens             430.3
1                 2  Philadelphia Eagles             411.7
2                 3  San Francisco 49ers             407.3
3                 4        Detroit Lions             399.7
4                 5    Green Bay Packers             391.7
5  Complete Leaders                 Team  Complete Leaders

In [69]:
df1_1.drop([0,5])

  Total Yards                 Team  YDS/G
1           2  Philadelphia Eagles  411.7
2           3  San Francisco 49ers  407.3
3           4        Detroit Lions  399.7
4           5    Green Bay Packers  391.7

In [72]:
df1_1.rename(columns={"Total Yards": "Ranking"})

            Ranking                 Team             YDS/G
0                 1     Baltimore Ravens             430.3
1                 2  Philadelphia Eagles             411.7
2                 3  San Francisco 49ers             407.3
3                 4        Detroit Lions             399.7
4                 5    Green Bay Packers             391.7
5  Complete Leaders                 Team  Complete Leaders

In [71]:
df1_1.drop([0,5])

  Total Yards                 Team  YDS/G
1           2  Philadelphia Eagles  411.7
2           3  San Francisco 49ers  407.3
3           4        Detroit Lions  399.7
4           5    Green Bay Packers  391.7

In [73]:
df1_1.drop([5])

  Total Yards                 Team  YDS/G
0           1     Baltimore Ravens  430.3
1           2  Philadelphia Eagles  411.7
2           3  San Francisco 49ers  407.3
3           4        Detroit Lions  399.7
4           5    Green Bay Packers  391.7

In [75]:
df1_1.to_csv("Total_Yards.csv")

In [76]:
df_total_passing = pd.DataFrame(Total_Passing)

In [77]:
Teams = ["San Francisco 49ers", "Dallas Cowboys", "Seattle Seahawks", "Las Vegas Raiders", "Philadelphia Eagles"]

In [79]:
df_total_passing.insert(1, "Team", ["San Francisco 49ers", "Dallas Cowboys", "Seattle Seahawks", "Las Vegas Raiders", "Philadelphia Eagles", "Team"], True)

In [80]:
print(df_total_passing)

            Passing                 Team             YDS/G
0                 1  San Francisco 49ers             267.7
1                 2       Dallas Cowboys             255.5
2                 3     Seattle Seahawks             246.7
3                 4    Las Vegas Raiders             244.7
4                 5  Philadelphia Eagles             244.3
5  Complete Leaders                 Team  Complete Leaders

In [83]:
df_total_passing.drop([5])

  Passing                 Team  YDS/G
0       1  San Francisco 49ers  267.7
1       2       Dallas Cowboys  255.5
2       3     Seattle Seahawks  246.7
3       4    Las Vegas Raiders  244.7
4       5  Philadelphia Eagles  244.3

In [84]:
df_total_passing.to_csv("Total_Passing.csv")

In [85]:
df_total_rushing = pd.DataFrame(Total_Rushing)

In [86]:
Teams = ["Green Bay Packers","Baltimore Ravens", "Philadelphia Eagles", "Detroit Lions", "Washington Commanders"]

In [88]:
df_total_rushing.insert(1, "Team", ["Green Bay Packers","Baltimore Ravens", "Philadelphia Eagles", "Detroit Lions", "Washington Commanders", "Team"], True)

In [89]:
print(df_total_rushing)

            Rushing                   Team             YDS/G
0                 1      Green Bay Packers             204.0
1                 2       Baltimore Ravens             203.3
2                 3    Philadelphia Eagles             167.3
3                 4          Detroit Lions             163.0
4                 5  Washington Commanders             153.7
5  Complete Leaders                   Team  Complete Leaders

In [90]:
df_total_rushing.rename(columns={"Rushing": "Ranking"})

            Ranking                   Team             YDS/G
0                 1      Green Bay Packers             204.0
1                 2       Baltimore Ravens             203.3
2                 3    Philadelphia Eagles             167.3
3                 4          Detroit Lions             163.0
4                 5  Washington Commanders             153.7
5  Complete Leaders                   Team  Complete Leaders

In [91]:
df_total_rushing.drop([5])

  Rushing                   Team  YDS/G
0       1      Green Bay Packers  204.0
1       2       Baltimore Ravens  203.3
2       3    Philadelphia Eagles  167.3
3       4          Detroit Lions  163.0
4       5  Washington Commanders  153.7

In [92]:
df_total_rushing.to_csv("Total_Rushing.csv")

In [93]:
df_total_yards_allowed = pd.DataFrame(Total_Yards_Allowed)

In [94]:
Teams = ["Pittsburgh Steelers", "Seattle Seahawks", "Denver Broncos", "Houston Texans", "Tennessee Titans"]

In [95]:
df_total_yards_allowed.insert(1, "Team", ["Pittsburgh Steelers", "Seattle Seahawks", "Denver Broncos", "Houston Texans", "Tennessee Titans", "Team"], True)

In [96]:
print(df_total_yards_allowed)

      Yards Allowed                 Team             YDS/G
0                 1  Pittsburgh Steelers             229.0
1                 2     Seattle Seahawks             248.7
2                 3       Denver Broncos             259.3
3                 4       Houston Texans             260.7
4                 5     Tennessee Titans             263.7
5  Complete Leaders                 Team  Complete Leaders

In [97]:
df_total_yards_allowed.rename(columns={"Yards Allowed": "Ranking"})

            Ranking                 Team             YDS/G
0                 1  Pittsburgh Steelers             229.0
1                 2     Seattle Seahawks             248.7
2                 3       Denver Broncos             259.3
3                 4       Houston Texans             260.7
4                 5     Tennessee Titans             263.7
5  Complete Leaders                 Team  Complete Leaders

In [98]:
df_total_rushing.drop([5])

  Rushing                   Team  YDS/G
0       1      Green Bay Packers  204.0
1       2       Baltimore Ravens  203.3
2       3    Philadelphia Eagles  167.3
3       4          Detroit Lions  163.0
4       5  Washington Commanders  153.7

In [99]:
df_total_yards_allowed.to_csv("Total_Yards_Allowed.csv")

In [100]:
df_total_sacks = pd.DataFrame(Total_Sacks)

In [101]:
Teams = ["Minnesota Vikings","New York Giants", "New York Jets", "Houston Texans", "Buffalo Bills"]

In [102]:
df_total_sacks.insert(1, "Team", ["Minnesota Vikings","New York Giants", "New York Jets", "Houston Texans", "Buffalo Bills", "Team"],True)

In [103]:
print(df_total_sacks)

              Sacks               Team              SACK
0                 1  Minnesota Vikings              16.0
1                 2    New York Giants              15.0
2                 3      New York Jets              14.0
3                 4     Houston Texans              13.0
4                 5      Buffalo Bills              11.0
5  Complete Leaders               Team  Complete Leaders

In [104]:
df_total_sacks.rename(columns={"Sacks": "Ranking"})

            Ranking               Team              SACK
0                 1  Minnesota Vikings              16.0
1                 2    New York Giants              15.0
2                 3      New York Jets              14.0
3                 4     Houston Texans              13.0
4                 5      Buffalo Bills              11.0
5  Complete Leaders               Team  Complete Leaders

In [105]:
df_total_sacks.drop([5])

  Sacks               Team  SACK
0     1  Minnesota Vikings  16.0
1     2    New York Giants  15.0
2     3      New York Jets  14.0
3     4     Houston Texans  13.0
4     5      Buffalo Bills  11.0

In [106]:
df_total_sacks.to_csv("Total_Sacks.csv")

In [107]:
df_total_turnovers = pd.DataFrame(Total_Turnovers)

In [108]:
Teams = ["Green Bay Packers", "Buffalo Bills", "New Orleans Saints", "Pittsburgh Steelers", "Los Angeles Chargers"]

In [109]:
df_total_turnovers.insert(1, "Team", ["Green Bay Packers", "Buffalo Bills", "New Orleans Saints", "Pittsburgh Steelers", "Los Angeles Chargers", "Teams"], True)

In [110]:
print(df_total_turnovers)

          Turnovers                  Team              DIFF
0                 1     Green Bay Packers                 7
1                 2         Buffalo Bills                 5
2                 3    New Orleans Saints                 4
3                 3   Pittsburgh Steelers                 4
4                 5  Los Angeles Chargers                 3
5  Complete Leaders                 Teams  Complete Leaders

In [111]:
df_total_turnovers.rename(columns={"Turnovers": "Ranking"})

            Ranking                  Team              DIFF
0                 1     Green Bay Packers                 7
1                 2         Buffalo Bills                 5
2                 3    New Orleans Saints                 4
3                 3   Pittsburgh Steelers                 4
4                 5  Los Angeles Chargers                 3
5  Complete Leaders                 Teams  Complete Leaders

In [112]:
df_total_turnovers.drop([5])

  Turnovers                  Team DIFF
0         1     Green Bay Packers    7
1         2         Buffalo Bills    5
2         3    New Orleans Saints    4
3         3   Pittsburgh Steelers    4
4         5  Los Angeles Chargers    3

In [113]:
df_total_turnovers.to_csv("Total_Turnovers.csv")